tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/C3H8
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C3H8;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }

    side
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    inlet
    {
        type                totalFlowRateAdvectiveDiffusive;
        value               uniform 1;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type                totalFlowRateAdvectiveDiffusive;
        massFluxFraction    1.0;
        value               $internalField;
    }

}


// ************************************************************************* //
